FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_LCDController.c
/*-------------------------------------------------------------------------*
 * File:  LCDController.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC43xx LCD Controller.
 * Implementation:
 *      Most of the configuration comes down to the single table passed
 *      in.  From there, we map SDRAM to the LCD.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <uEZPlatform.h>
#include <Source/Processor/NXP/LPC43xx/LPC43xx_LCDController.h>
#include <uEZBSP.h>
#include <HAL/Interrupt.h>
#include "LPC43xx_UtilityFuncs.h"

/* For using 204MHz main CPU clock the following are available in this driver:
 * Divider (X) 0-16, clock (Y) in MHz: 204000000/(X+2)/1000/1000=Y
 * Possible Y value clocks in MHz:
 * 11.33,12,12.75,13.6,14.57,15.69,17,18.55,20.4,22.67,25.5,29.143,34,40.8,51,68
 */

/* For using 160MHz main CPU clock/2 the following are available in this driver:
 * Divider (X) 0-16, clock (Y) in MHz: 160000000/(X+2)/1000/1000=Y
 * Possible Y value clocks in MHz:
 * 11.33,12,12.75,13.6,14.57,15.69,17,18.55,20.4,22.67,25.5,29.143,34,40.8,51,68
 */

/* For using 120MHz main CPU clock the following are available in this driver:
 * Divider (X) 0-16, clock (Y) in MHz: 120000000/(X+2)/1000/1000=Y
 * Possible Y value clocks in MHz:
 * 6.67,7.0588,7.5,8,8.5714,9.2307,10,10.9090,12,13.33,15,17.1428,20,24,30,40
 * This has a noticeable impact on panel selection for higher clock rates.
 * If a weird clock was needed, an external clock could be supplied to a pin.
 */

/* For using 102MHz main CPU clock/2 the following are available in this driver:
 * Divider (X) 0-16, clock (Y) in MHz: 102000000/(X+2)/1000/1000=Y
 * Possible Y value clocks in MHz:
 * 5.67,6,6.37,6.8,7.29,7.85,8.5,9.27,10.2,11.33,12.75,14.57,17,20.4,25.5,34,51
 */
 
// While 480 is in the clock tree, we can't go over 204 in this peripheral.
#define LCD_SOURCE_CLOCK_204 204000000 // not tested yet
#define LCD_SOURCE_CLOCK_160 160000000 // not tested yet
#define LCD_SOURCE_CLOCK_120 120000000
#define LCD_SOURCE_CLOCK_102 102000000 // defualt in PLL.c

#ifndef LCD_SOURCE_CLOCK
//#define LCD_SOURCE_CLOCK          LCD_SOURCE_CLOCK_204
//#define LCD_SOURCE_CLOCK          LCD_SOURCE_CLOCK_160
//#define LCD_SOURCE_CLOCK          LCD_SOURCE_CLOCK_120
#define LCD_SOURCE_CLOCK          LCD_SOURCE_CLOCK_102
#endif

/*---------------------------------------------------------------------------*
 * Constants:
 *---------------------------------------------------------------------------*/
#define LCD_POL_IVS             (1<<11)
#define LCD_POL_IHS             (1<<12)
#define LCD_POL_IPC             (1<<13)
#define LCD_POL_IOE             (1<<14)
#define LCD_CTRL_LcdBpp_BIT     1
#define LCD_CTRL_LcdEn          (1<<0)
#define LCD_CTRL_LcdBW          (1<<4)
#define LCD_CTRL_LcdTFT         (1<<5)
#define LCD_CTRL_LcdMon8        (1<<6)
#define LCD_CTRL_LcdDual        (1<<7)
#define LCD_CTRL_BGR            (1<<8)
#define LCD_CTRL_LcdPwr         (1<<11)

#define LCD_INT_LNBUIM          (1<<2)

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_LCDController *iHAL;
    TUInt32 iBaseAddress;
    TUInt16 iPalette[256];
    HAL_GPIOPort **iPowerPort;
    TUInt32 iPowerPin;
    TBool iPowerPinIsActiveHigh;
    TUInt32 iPowerOnDelay;

    LCDControllerVerticalSync iVerticalSyncCallbackFunc;
    void *iVerticalSyncCallbackWorkspace;
} T_workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_LCDController LCDController_LPC43xx_Interface;
static T_workspace *G_LPC43xx_lcdWorkspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static void ILPC43xx_ProcessVerticalSync(T_workspace *p);
T_uezError LPC43xx_LCDController_DisableVerticalSync(void *aWorkspace);

/*---------------------------------------------------------------------------*
 * Routine:  LCDControllerVerticalIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Interrupt handler for LCD interrupts.  Process the interrupt
 *      in ILPC43xx_ProcessVerticalSync().
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LCDControllerVerticalIRQ)
{
    IRQ_START();
    ILPC43xx_ProcessVerticalSync(G_LPC43xx_lcdWorkspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC43xx_ProcessVerticalSync
 *---------------------------------------------------------------------------*
 * Description:
 *      Interrupt handler for LCD interrupts.  Process the interrupt
 *      in ILPC43xx_ProcessVerticalSync().
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
void ILPC43xx_ProcessVerticalSync(T_workspace *p)
{
    // Determine the type of interrupt
    TUInt32 flags = LPC_LCD->INTSTAT;    

    // Next base address updated?
    if (flags & LCD_INT_LNBUIM) {
        // Make the callback (if one is available)
        if (p->iVerticalSyncCallbackFunc) {
            // Make the callback
            p->iVerticalSyncCallbackFunc(p->iVerticalSyncCallbackWorkspace);
        }
    }
    // Clear any interrupts processed by this interrupt
    LPC_LCD->INTCLR = flags;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this LCD Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_InitializeWorkspace(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;
    p->iHAL = &LCDController_LPC43xx_Interface;
    p->iBaseAddress = 0x28000000; // use default address
    p->iPowerPort = 0;
    p->iPowerPin = 0;
    p->iPowerPinIsActiveHigh = EFalse;
    p->iPowerOnDelay = 10; // ms
    p->iVerticalSyncCallbackFunc = 0;
    p->iVerticalSyncCallbackWorkspace = 0;

