FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_LCDController.c
    // Setup workspace for this space for interrupts
    G_LPC43xx_lcdWorkspace = p;

#ifdef CORE_M4
    // Register interrupts for this LCD Controller
    InterruptRegister(LCD_IRQn, LCDControllerVerticalIRQ,
        INTERRUPT_PRIORITY_NORMAL, "VSync");
    InterruptEnable(LCD_IRQn);
#endif
#ifdef CORE_M0
    // Register interrupts for this LCD Controller
    InterruptRegister(M0_LCD_IRQn, LCDControllerVerticalIRQ,
        INTERRUPT_PRIORITY_NORMAL, "VSync");
    InterruptEnable(M0_LCD_IRQn);
#endif
#ifdef CORE_M0SUB
#endif

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the LCD screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 *      T_LCDControllerSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_Configure(
        void *aWorkspace,
        T_LCDControllerSettings *aSettings)
{
    TUInt32 regValue = 0;
    TUInt32* pPal = 0;
    TUInt32 dotClockDivider;
    int32_t i = 0;
    T_workspace *p = (T_workspace *)aWorkspace;
    TUInt32 calcDiv;

    // Turn on the power to the subsystem

    // Turn on peripheral clock
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_204)
    // TODO turn off divider
#endif
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_160)
    LPC_CGU->IDIVA_CTRL = (7<<24) | (1<<11) | (2<<2); //Produce a 160MHz clock on DIVA
    LPC_CGU->BASE_LCD_CLK = (0xC<<24) | (1<<11); // auto block enabled, DIVA clock selected 120MHz
#endif
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_120)
    LPC_CGU->BASE_LCD_CLK = (0xC<<24) | (1<<11); // auto block enabled, DIVA clock selected 120MHz
#endif
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_102)
    LPC_CGU->BASE_LCD_CLK = (9<<24) | (1<<11); // auto block enabled, PLL1 clock selected 102MHz
#endif

    // disable the display`
    LPC_LCD->CTRL &= ~LCD_CTRL_LcdEn;

    // ppl value to set = ppl / 16 -1 (2:7)
    // hsw value to set = hsw - 1     (8:15)
    // hfp value to set = hfp - 1     (16:23)
    // hbp value to set = hbp - 1     (24:31)
    LPC_LCD->TIMH = ((((((aSettings->iHorizontalPixelsPerLine) / 16) - 1)
            & 0x3F) << 2)
            | (((aSettings->iHorizontalSyncPulseWidth - 1) & 0xFF) << 8)
            | (((aSettings->iHorizontalFrontPorch - 1) & 0xFF) << 16)
            | (((aSettings->iHorizontalBackPorch - 1) & 0xFF) << 24));

    LPC_LCD->TIMV = ((((aSettings->iVerticalLinesPerPanel - 1) & 0x3FF) << 0)
            | (((aSettings->iVerticalSyncPulseWidth - 1) & 0x03F) << 10)
            | (((aSettings->iVerticalFrontPorch) & 0x0FF) << 16)
            | (((aSettings->iVerticalBackPorch) & 0x0FF) << 24));

    regValue = 0;
    if (aSettings->iACBiasPinFrequency)
        regValue = (((aSettings->iACBiasPinFrequency - 1) & 0x1F) << 6);

    if (aSettings->iInvertOutputEnable)
        regValue |= LCD_POL_IOE;

    if (aSettings->iInvertPanelClock)
        regValue |= LCD_POL_IPC;

    if (aSettings->iInvertHorizontalSync)
        regValue |= LCD_POL_IHS;

    if (aSettings->iInvertVerticalSync)
        regValue |= LCD_POL_IVS;

    // clocks per line (CPL)
    switch (aSettings->iPanelType) {
        case LCD_STANDARD_TFT:
        case LCD_ADVANCED_TFT:
        case LCD_HIGHLY_REFLECTIVE_TFT:
        default:
            regValue |= (((aSettings->iHorizontalPixelsPerLine - 1) & 0x3FF)
                    << 16);
            break;
        case LCD_4BIT_MONO:
            regValue |= ((((aSettings->iHorizontalPixelsPerLine / 4) - 1)
                    & 0x3FF) << 16);
            break;
        case LCD_8BIT_MONO:
            regValue |= ((((aSettings->iHorizontalPixelsPerLine / 8) - 1)
                    & 0x3FF) << 16);
            break;
        case LCD_COLOR_STN:
            regValue |= (((((aSettings->iHorizontalPixelsPerLine * 3) / 8) - 1)
                    & 0x3FF) << 16);
            break;
    }

    
    // Find the dot clock divider with the fastest clock rate to match the requested
    // dot clock rate without going over.
    for (dotClockDivider = 0; dotClockDivider < 0x0F; dotClockDivider++) {
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_204)
        calcDiv = (PROCESSOR_OSCILLATOR_FREQUENCY / (dotClockDivider + 1)); // TODO
#endif
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_160)
        calcDiv = (LCD_SOURCE_CLOCK_160 / (dotClockDivider + 2));
#endif
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_120)
        calcDiv = (LCD_SOURCE_CLOCK_120 / (dotClockDivider + 2));
#endif
#if (LCD_SOURCE_CLOCK==LCD_SOURCE_CLOCK_102)
        calcDiv = (PROCESSOR_OSCILLATOR_FREQUENCY / (dotClockDivider + 2));
#endif
        if (calcDiv <= aSettings->iDotClockHz)
            break;
    }
    regValue |= dotClockDivider;

    LPC_LCD->POL = regValue;

    // skip line end control
    if (aSettings->iLineEndDelay) {
        // Enable and set
        LPC_LCD->LE = ((aSettings->iLineEndDelay - 1) << 0) | (1 << 16);
    } else {
        LPC_LCD->LE = 0;
    }

    // disable interrupts
    // TBD: May need vertical interrupt in the future
    LPC_LCD->INTMSK = 0;

    switch (aSettings->iColorResolution) {
        default:
        case LCD_COLOR_RES_1:
            regValue = (0 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_2:
            regValue = (1 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_4:
            regValue = (2 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_8:
            regValue = (3 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_12_444:
            regValue = (7 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_16_I555:
            regValue = (4 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_16_565:
            regValue = (6 << LCD_CTRL_LcdBpp_BIT);
            break;
        case LCD_COLOR_RES_24:
            regValue = (5 << LCD_CTRL_LcdBpp_BIT);
            break;
    }

