FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_LCDController.c
    // default BGR
    if (aSettings->iColorOrder == LCD_COLOR_ORDER_BGR)
        regValue |= LCD_CTRL_BGR;

    switch (aSettings->iPanelType) {
        case LCD_ADVANCED_TFT:
        case LCD_HIGHLY_REFLECTIVE_TFT:
        case LCD_STANDARD_TFT:
            // Enable port and use TFT
            regValue |= LCD_CTRL_LcdTFT;
            break;
        case LCD_4BIT_MONO:
            // Enable port and use 4-bit STN
            regValue |= LCD_CTRL_LcdBW;
            break;
        case LCD_8BIT_MONO: // Enable port and use 8-bit STN
            regValue |= (LCD_CTRL_LcdMon8 | LCD_CTRL_LcdBW);
            break;
        case LCD_COLOR_STN:
            break;
        default:
            // ERROR
            break;
    }

    if (aSettings->iIsDualPanel)
        regValue |= LCD_CTRL_LcdDual;

    LPC_LCD->CTRL = regValue;

    // clear palette (all black)
    pPal = (TUInt32*)(&(LPC_LCD->PAL));
    for (i = 0; i < 128; i++) {
        *pPal = 0;
        pPal++;
    }

    // 0 = divide by 1 dot clock
    //TBD: Where is this register really?    LPC_LCD->CFG = 0x0;

    // Set the base address
    p->iBaseAddress = aSettings->iBaseAddress;
    LPC_LCD->UPBASE = p->iBaseAddress;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_On
 *---------------------------------------------------------------------------*
 * Description:
 *      Power on and enable the LCD.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_On(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    // Ensure the LCD is enabled and powered
    LPC_LCD->CTRL |= LCD_CTRL_LcdEn;
    LPC_LCD->CTRL |= LCD_CTRL_LcdPwr;

    if (p->iPowerPort) {
        if (p->iPowerPinIsActiveHigh) {
            (*p->iPowerPort)->Set(p->iPowerPort, p->iPowerPin);
        } else {
            (*p->iPowerPort)->Clear(p->iPowerPort, p->iPowerPin);
        }
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_Off
 *---------------------------------------------------------------------------*
 * Description:
 *      Power off and disable the LCD.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_Off(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    // Ensure the LCD is enabled and powered
    LPC_LCD->CTRL &= ~LCD_CTRL_LcdEn;
    LPC_LCD->CTRL &= ~LCD_CTRL_LcdPwr;

    // Turn off the power pin if we have one
    if (p->iPowerPort) {
        if (p->iPowerPinIsActiveHigh) {
            (*p->iPowerPort)->Clear(p->iPowerPort, p->iPowerPin);
        } else {
            (*p->iPowerPort)->Set(p->iPowerPort, p->iPowerPin);
        }
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_SetBacklightLevel
 *---------------------------------------------------------------------------*
 * Description:
 *      Control the backlight level.  For LPC43xx, this is not a feature.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 *      TUInt32 aLevel            -- Level to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_SetBacklightLevel(
        void *aWorkspace,
        TUInt32 aLevel)
{
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aLevel);
    // Not handled here in this LCD Controller
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_SetBaseAddr
 *---------------------------------------------------------------------------*
 * Description:
 *      Changes the address in memory where the LCD controller gets it's
 *      pixels and if that change should occur synchronously.
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 *      TUInt32 aBaseAddress      -- New pixel memory base address
 *      TBool aSync               -- Wait for raster?
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_SetBaseAddr(
        void *aWorkspace,
        TUInt32 aBaseAddress,
        TBool aSync)
{
    PARAM_NOT_USED(aSync);
    T_workspace *p = (T_workspace *)aWorkspace;

    p->iBaseAddress = aBaseAddress;
    LPC_LCD->UPBASE = p->iBaseAddress;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_SetPaletteColor
 *---------------------------------------------------------------------------*
 * Description:
 *      Change the color of a palette entry given the red, green, blue
 *      component of a particular color index.  The color components are
 *      expressed in full 16-bit values at a higher resolution than
 *      the hardware can usually perform.  The color is down shifted to what
 *      the hardware can handle.
 * Inputs:
 *      void *aWorkspace            -- LCD Controller's workspace
 *      TUInt32 aColorIndex         -- Index to palette entry
 *      TUInt16 aRed                -- Red value
 *      TUInt16 aGreen              -- Green value
 *      TUInt16 aBlue               -- Blue value
 * Outputs:
 *      T_uezError               -- If successful, returns UEZ_ERROR_NONE.
 *                                  If the index is invalid, returns
 *                                  UEZ_ERROR_OUT_OF_RANGE.
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_SetPaletteColor(
        void *aWorkspace,
        TUInt32 aColorIndex,
        TUInt16 aRed,
        TUInt16 aGreen,
        TUInt16 aBlue)
{
    TUInt32 *pPal;
    T_workspace *p = (T_workspace *)aWorkspace;
    TUInt16 neighbor;
    TUInt32 aPackedColor;

