FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_LCDController.c
    // Don't allow buffer overruns
    if (aColorIndex >= 256)
        return UEZ_ERROR_OUT_OF_RANGE;

    // Use the upper 5 bits of red, green, and blue
    // Creating a 5/5/5 palette entry (we'll leave the last bit always
    // 0 which for the LPC24xx family means intensity or unused).
    aPackedColor = ((aBlue >> 11) & (0x1F << 0))
            | ((aGreen >> 6) & (0x1F << 5)) | ((aRed >> 1) & (0x1F << 10));

    // Half and half, the index decides which half to use.
    // For now, going to assume we are MSB configured.
    pPal = ((TUInt32*)(&LPC_LCD->PAL[0])) + (aColorIndex >> 1);
    if (aColorIndex & 1) {
        neighbor = p->iPalette[aColorIndex - 1];
        *pPal = (neighbor << 0) | (aPackedColor << 16);
    } else {
        neighbor = p->iPalette[aColorIndex];
        *pPal = (neighbor << 16) | (aPackedColor << 0);
    }
    // Remember this in the local palette
    p->iPalette[aColorIndex] = aPackedColor;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LCDController_LPC43xx_ConfigurePowerPin
 *---------------------------------------------------------------------------*
 * Description:
 *      Configures the power pin
 * Inputs:
 *      void *aWorkspace             -- LCD Controller's workspace
 *      HAL_GPIOPort **aPowerPort    -- Pointer to HAL GPIO port
 *      TUInt32 aPowerPinIndex       -- Index of port pin
 *      TBool aPowerPinIsActiveHigh  -- ETrue if active high, EFalse otherwise
 *      TUInt32 aPowerOnDelay        -- Delay (in milliseconds?)
 * Outputs:
 *      T_uezError                   -- If successful, returns UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
T_uezError LCDController_LPC43xx_ConfigurePowerPin(
            void *aWorkspace,
            HAL_GPIOPort **aPowerPort,
            TUInt32 aPowerPinIndex,
            TBool aPowerPinIsActiveHigh,
            TUInt32 aPowerOnDelay)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    p->iPowerPort = aPowerPort;
    p->iPowerPin = 1<<aPowerPinIndex;
    p->iPowerPinIsActiveHigh = aPowerPinIsActiveHigh;
    p->iPowerOnDelay = aPowerOnDelay;

    // Ensure it is a GPIO and output mode and off
    if (p->iPowerPinIsActiveHigh)
        (*p->iPowerPort)->Clear(p->iPowerPort, p->iPowerPin);
    else
        (*p->iPowerPort)->Set(p->iPowerPort, p->iPowerPin);

    (*p->iPowerPort)->SetMux(p->iPowerPort, aPowerPinIndex, 0);
    (*p->iPowerPort)->SetOutputMode(p->iPowerPort, p->iPowerPin);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_EnableVerticalSync
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable Vertical sync on LCD.
 * Inputs:
 *      void *aWorkspace                         -- LCD Controller's workspace
 *      LCDControllerVerticalSync aCallbackFunc  -- Call back function
 *      void *aCallbackWorkspace                 -- Call back workspace
 * Outputs:
 *      T_uezError                               -- If successful, returns
 *                                               UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_EnableVerticalSync(
    void *aWorkspace,
    LCDControllerVerticalSync aCallbackFunc,
    void *aCallbackWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    // Disable the interrupt
    if (p->iVerticalSyncCallbackFunc)
        LPC43xx_LCDController_DisableVerticalSync(aWorkspace);

    p->iVerticalSyncCallbackFunc = aCallbackFunc;
    p->iVerticalSyncCallbackWorkspace = aCallbackWorkspace;

    // Enable the mask
    LPC_LCD->INTMSK |= LCD_INT_LNBUIM;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_LCDController_DisableVerticalSync
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable Vertical sync on LCD.
 * Inputs:
 *      void *aWorkspace       -- LCD Controller's workspace
 * Outputs:
 *      T_uezError             -- If successful, returns UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_LCDController_DisableVerticalSync(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    if (p->iVerticalSyncCallbackFunc) {
        // Disable the mask (if it was on)
        LPC_LCD->INTMSK &= ~LCD_INT_LNBUIM;

        p->iVerticalSyncCallbackFunc = 0;
        p->iVerticalSyncCallbackWorkspace = 0;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_LCDController LCDController_LPC43xx_Interface = {
        {
        "LPC43xx LCDController",
        0x0100,
        LPC43xx_LCDController_InitializeWorkspace,
        sizeof(T_workspace),
        },

        LCDCONTROLLER_FEATURE_POWER | LCDCONTROLLER_FEATURE_DUAL_PANEL
                | LCDCONTROLLER_FEATURE_DYNAMIC_BASE_ADDR
                | LCDCONTROLLER_FEATURE_PALETTE_CONTROL,

        LPC43xx_LCDController_Configure,
        LPC43xx_LCDController_On,
        LPC43xx_LCDController_Off,
        LPC43xx_LCDController_SetBacklightLevel,
        LPC43xx_LCDController_SetBaseAddr,
        LPC43xx_LCDController_SetPaletteColor,
        LPC43xx_LCDController_EnableVerticalSync,
        LPC43xx_LCDController_DisableVerticalSync
};

#define LCD_PIN     ((1 << 7) | (1 << 6) | (1 << 5) | (2 << 3))
/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC43xx_LCDController_Require(const T_LPC43xx_LCDController_Pins *aPins)
{
    T_halWorkspace *p_lcd;
    
    static const T_LPC43xx_SCU_ConfigList pinsVD0[] = {
            {GPIO_P2_1,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD0
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD1[] = {
            {GPIO_P2_4,  SCU_HIGH_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)},   // LCD_VD1 //HD-pin
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD2[] = {
            {GPIO_P2_3,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD2
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD3[] = {
            {GPIO_P2_2,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD3
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD4[] = {
            {GPIO_P3_12, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD4
            {GPIO_P4_7,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD4
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD5[] = {
            {GPIO_P3_11, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD5
            {GPIO_P4_6,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD5
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD6[] = {
            {GPIO_P3_10, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD6
            {GPIO_P4_5,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD6
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD7[] = {
            {GPIO_P3_9,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD7
            {GPIO_P4_4,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD7
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD8[] = {
            {GPIO_P3_13, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD8
            {GPIO_P4_5,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD8
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD9[] = {
            {GPIO_P5_12, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD9
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD10[] = {
            {GPIO_P5_14, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD10
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD11[] = {
            {GPIO_P5_13, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD11
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD12[] = {
            {GPIO_P4_3,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD12
            {GPIO_P2_2,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD12
            {GPIO_P1_15, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(7)}, // LCD_VD12
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD13[] = {
            {GPIO_P1_14, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(7)}, // LCD_VD13
            {GPIO_P2_0,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD13
            {GPIO_P5_26, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD13
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD14[] = {
            {GPIO_P5_9,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(6)}, // LCD_VD14
            {GPIO_P5_14, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD14
            {GPIO_P5_25, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD14
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD15[] = {
            {GPIO_P5_8,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(6)}, // LCD_VD15
            {GPIO_P5_13, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD15
            {GPIO_P5_24, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD15
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD16[] = {
            {GPIO_P3_12, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD16
            {GPIO_P4_4,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD16
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD17[] = {
            {GPIO_P3_11, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD17
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD18[] = {
            {GPIO_P3_10, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD18
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD19[] = {
            {GPIO_P2_1,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD19
            {GPIO_P3_9,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_VD19
            {GPIO_P4_3,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD19
            {GPIO_P5_26, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(6)}, // LCD_VD19
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD20[] = {
            {GPIO_P2_4,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD20
            {GPIO_P5_23, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD20
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD21[] = {
            {GPIO_P2_3,  SCU_HIGH_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)},   // LCD_VD21 //HD-pin
            {GPIO_P5_22, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD21
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD22[] = {
            {GPIO_P5_12, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(5)}, // LCD_VD22
            {GPIO_P5_21, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD22
    };
    static const T_LPC43xx_SCU_ConfigList pinsVD23[] = {
            {GPIO_P3_13, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_VD23
            {GPIO_P5_20, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_VD23
    };
    static const T_LPC43xx_SCU_ConfigList pinsPWR[] = {
            {GPIO_P3_15, SCU_NORMAL_DRIVE_DEFAULT(3)},               // LCD_PWR
            {GPIO_PZ_3_P4_7,  SCU_NORMAL_DRIVE_DEFAULT(4)},          // LCD_PWR
            {GPIO_P5_25, SCU_NORMAL_DRIVE_DEFAULT(6)},               // LCD_PWR
    };
    static const T_LPC43xx_SCU_ConfigList pinsLE[] = {
            {GPIO_P3_8,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_LE
    };
    static const T_LPC43xx_SCU_ConfigList pinsDCLK[] = {
            {GPIO_PZ_3_P4_7, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(0)}, // LCD_DCLK
            {GPIO_PZ_Z_PC_0, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_DCLK
    };
    static const T_LPC43xx_SCU_ConfigList pinsFP[] = {
            {GPIO_P2_5,  SCU_HIGH_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)},   // LCD_FP   //HD-pin
    };
    static const T_LPC43xx_SCU_ConfigList pinsENAB[] = {
            {GPIO_P2_6,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(2)}, // LCD_ENAB_M
    };
    static const T_LPC43xx_SCU_ConfigList pinsLP[] = {
            {GPIO_P3_14, SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(3)}, // LCD_LP
            {GPIO_P4_6,  SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(4)}, // LCD_LP
    };
    static const T_LPC43xx_SCU_ConfigList pinsCLKIN[] = {
            {GPIO_PZ_8_PF_0, SCU_NORMAL_DRIVE_DEFAULT(1)}, // LCD_CLKIN
    };

    //LPC_SCU->SFSP4_6 = LCD_PIN | 2; // LCD_ENAB @ P4.6

    // Register LCD Controller
    HALInterfaceRegister("LCDController",
            (T_halInterface *)&LCDController_LPC43xx_Interface, 0, &p_lcd);

